app/controllers/admin/paper_formats_controller.rb

SELECT * FROM `paper_formats` LIMIT 0, 10
---
  def index
    @paper_formats = PaperFormat.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM `paper_formats` WHERE (`paper_formats`.`id` = 2)
---
  def show
    @paper_format = PaperFormat.find(params[:id])

SELECT * FROM `paper_formats` WHERE (`paper_formats`.`id` = 2)
---
  def edit
    @paper_format = PaperFormat.find(params[:id])

INSERT INTO `paper_formats` (`created_at`, `updated_at`, `height`, `width`) VALUES('2010-01-26 16:01:43', '2010-01-26 16:01:43', 15.0, 10.0)
---
  def create
    @paper_format = PaperFormat.new(params[:paper_format])

    respond_to do |format|
      if @paper_format.save

SELECT * FROM `paper_formats` WHERE (`paper_formats`.`id` = 2)
UPDATE `paper_formats` SET `updated_at` = '2010-01-26 16:08:24', `height` = 13.0, `width` = 9.5 WHERE `id` = 2
---
  def update
    @paper_format = PaperFormat.find(params[:id])

    respond_to do |format|
      if @paper_format.update_attributes(params[:paper_format])