app/controllers/admin/paper_types_controller.rb

  def index
    @paper_types = PaperType.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `paper_types` LIMIT 0, 10

  def show
    @paper_type = PaperType.find(params[:id])
---
SELECT * FROM `paper_types` WHERE (`paper_types`.`id` = 2)

  def create
    @paper_type = PaperType.new(params[:paper_type])

    respond_to do |format|
      if @paper_type.save
---
INSERT INTO `paper_types` (`name`, `created_at`, `updated_at`) VALUES('Матовая', '2010-01-26 16:23:30', '2010-01-26 16:23:30')