app/controllers/admin/printer_types_controller.rb

  def index
    @printer_types = PrinterType.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `printer_types` LIMIT 0, 10

  def show
    @printer_type = PrinterType.find(params[:id])
---
SELECT * FROM `printer_types` WHERE (`printer_types`.`id` IN ('--- :admin\n',3))

  def edit
    @printer_type = PrinterType.find(params[:id])
---
SELECT * FROM `printer_types` WHERE (`printer_types`.`id` = 6)

  def create
    @printer_type = PrinterType.new(params[:printer_type])

    respond_to do |format|
      if @printer_type.save
---
INSERT INTO `printer_types` (`name`, `created_at`, `updated_at`) VALUES('jjj', '2010-01-25 18:21:38', '2010-01-25 18:21:38')

  def update
    @printer_type = PrinterType.find(params[:id])
---
SELECT * FROM `printer_types` WHERE (`printer_types`.`id` = 6)

  def destroy
    @printer_type = PrinterType.find(params[:id])
    @printer_type.destroy
---
SELECT * FROM `printer_types` WHERE (`printer_types`.`id` = 2)
DELETE FROM `printer_types` WHERE `id` = 2