app/controllers/albums_controller.rb

SELECT * FROM `albums` LIMIT 0, 10
SELECT count(*) AS count_all FROM `albums`
---
  def index
    @albums = Album.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def show
    @album = Album.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def edit
    @album = Album.find(params[:id])

INSERT INTO `albums` (`name`, `artist`, `created_at`, `updated_at`, `date`) VALUES('', '', '2010-01-26 09:12:56', '2010-01-26 09:12:56', '2010-01-26')
---
  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save

SELECT * FROM `albums` WHERE (`albums`.`id` = 6)
UPDATE `albums` SET `updated_at` = '2010-01-26 09:35:03', `name` = 'Название альбома', `artist` = 'Исполнитель', `date` = '2006-01-26' WHERE `id` = 16
---
  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
DELETE FROM `albums` WHERE `id` = 1
---
  def destroy
    @album = Album.find(params[:id])
    @album.destroy