app/controllers/printer_types_controller.rb

  def index
    @printer_types = PrinterType.all
---
SELECT * FROM `printer_types`

  def edit
    @printer_type = PrinterType.find(params[:id])
---
SELECT * FROM `printer_types` WHERE (`printer_types`.`id` = 5)