app/controllers/test1s_controller.rb

SELECT * FROM `test1s`
---
  def index
    @test1s = Test1.all

SELECT * FROM "test1s" WHERE ("test1s"."id" = 1)
---
  def show
    @test1 = Test1.find(params[:id])

INSERT INTO "test1s" ("name", "created_at", "updated_at") VALUES('1', '2010-01-23 12:08:21', '2010-01-23 12:08:21')
---
  def create
    @test1 = Test1.new(params[:test1])

    respond_to do |format|
      if @test1.save

SELECT * FROM "test1s" WHERE ("test1s"."id" = 1)
DELETE FROM "test1s" WHERE "id" = 1
---
  def destroy
    @test1 = Test1.find(params[:id])
    @test1.destroy